# DataFrame

In [1]:
import numpy as np
import pandas as pd

### 2. DataFrame

### 1) 생성

In [3]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70]
}
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index = index)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [7]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(40,101,12).reshape(4,3),
                    columns = ["국어", "영어", "수학"], index = index)
df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

In [17]:
#반복문으로 데이터를 만드는 경우 딕셔너리의 리스트를 만들어 생성
l = []
for i in range(4):
    d={"국어":np.random.randint(40,101), 
       "영어":np.random.randint(40,101), 
       "수학":np.random.randint(40,101)}
    l.append(d)
l

[{'국어': 93, '영어': 91, '수학': 67},
 {'국어': 84, '영어': 95, '수학': 91},
 {'국어': 49, '영어': 76, '수학': 81},
 {'국어': 79, '영어': 65, '수학': 47}]

In [18]:
df3 = pd.DataFrame(l,index=index)
df3

    국어  영어  수학
춘향  93  91  67
몽룡  84  95  91
향단  49  76  81
방자  79  65  47

### 2)인덱싱

In [19]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [22]:
df['국어']

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [23]:
df.국어

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [24]:
## 인덱싱은 열 -> 행 순서

In [29]:
df["국어"][0], df['국어']['춘향'], df.국어[0], df.국어.춘향

(80, 80, 80, 80)

In [34]:
df['국어'][:2]

춘향    80
몽룡    90
Name: 국어, dtype: int64

In [36]:
df[['국어','영어']][:2]

    국어  영어
춘향  80  90
몽룡  90  70

In [41]:
df[['국어','영어']][:'향단']

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60

In [47]:
df[['국어']]

    국어
춘향  80
몽룡  90
향단  70
방자  30

In [53]:
df[['국어','영어','수학']][:'춘향']

    국어  영어  수학
춘향  80  90  90

- loc 인덱서 : [행 인덱스 -> 열 인덱스]

In [68]:
df.loc['몽룡','국어']

90

In [82]:
df.loc['몽룡'][0], df.loc['몽룡']['국어']

(90, 90)

- iloc 인덱서: [행숫자,열숫자]

In [83]:
df.iloc[1,0]

90

- 값 변경 및 열 추가

In [86]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [88]:
df['국어']['방자'] = 75
df['영어']['방자'] = 82
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  75  82  70

In [90]:
df['과학'] = 30
df

    국어  영어  수학  과학
춘향  80  90  90  30
몽룡  90  70  60  30
향단  70  60  80  30
방자  75  82  70  30

In [95]:
df['과학'] =[30,40,50,60]
df

    국어  영어  수학  과학
춘향  80  90  90  30
몽룡  90  70  60  40
향단  70  60  80  50
방자  75  82  70  60

- 열 삭제

In [103]:
del df['과학']
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  75  82  70

In [111]:
df.drop(['방자'])

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80

In [114]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  75  82  70

In [116]:
df.drop(['방자'], inplace = True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80

In [117]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80